In [2]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

# Create path variable
path = r'C:\Users\howel\OneDrive\Instacart Basket Analysis'

# Import Customer Data
df_customers = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

# Check the output
df_customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [3]:
# Rename columns to be consistent with other dataframes
df_customers.rename(columns = {'First Name': 'first_name', 'Surnam': 'last_name', 'Gender': 'gender', 'STATE': 'state', 'Age': 'age', 'date_joined': 'date_joined', 'n_dependants': 'n_dependants', 'fam_status': 'fam_status', 'income': 'income'}, inplace = True)

# Check the changes
df_customers.head()

,user_id,first_name,last_name,gender,state,age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [4]:
# Check for mixed types
for col in df_customers.columns.tolist():
  weird = (df_customers[[col]].map(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len(df_customers[weird]) > 0:
    print (col)

first_name

In [5]:
# Check for missing values
df_customers.isnull().sum()

user_id             0
first_name      11259
last_name           0
gender              0
state               0
age                 0
date_joined         0
n_dependants        0
fam_status          0
income              0
dtype: int64

In [6]:
# Check for duplicates
df_customers_dups = df_customers[df_customers.duplicated()]
df_customers_dups

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, n_dependants, fam_status, income]
Index: []

In [9]:
# 1. Import most recent main data
orders_products_merged = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_merged.pkl'))

# 2. Check data types of the key column 'user_id'
orders_products_merged['user_id'].dtype
df_customers['user_id'].dtype

# 3. Merge the dataframes
orders_products_cust_merged = orders_products_merged.merge(df_customers, on = 'user_id', how = 'inner')

# 4. Check the shape to ensure no data was lost significantly
orders_products_cust_merged.shape

(32404859, 31)

In [10]:
orders_products_cust_merged.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_cust_merged.pkl'))